## Plan Result (ptl-netbox)




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault.netbox_key_vault
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_resource_group.netbox_rg
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;netbox&#34;]
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.postgresql_flexible.random_password.password
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis
  * module.redis.azurerm_resource_group.cache-resourcegroup




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.netbox_key_vault will be created
  + resource "azurerm_key_vault" "netbox_key_vault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "netbox-vault-ptl"
      + public_network_access_enabled = true
      + resource_group_name           = "netbox-ptl-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-DATABASE-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.netbox_rg will be created
  + resource "azurerm_resource_group" "netbox_rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "netbox-ptl-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "netbox-v14-flexible-ptl"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "netbox-v14-flexible-data-ptl"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "netbox-v14-flexible-data-ptl"
      + server_name         = "netbox-v14-flexible-ptl"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["netbox"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "netbox"
      + server_id = (known after apply)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "netbox-v14-flexible-data-ptl"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.postgresql_flexible.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.redis.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "netbox-ptl"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "netbox-cache-ptl"
      + subnet_id                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas"
      + tags                     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "netbox-ptl"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "netbox-ptl"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "netbox-cache-ptl"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "netbox-cache-ptl"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/rdo-netbox"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"ptl-netbox","Vars":{}} -->